mauro-medina10/dsPIC33F_FreeRTOS_Anemometro_v1/Demo/dsPIC33F_MPLAB/main.c
/*
 * File:   main.c
 * Author: MWA692
 *
 * Created on July 20, 2020, 2:46 PM
 */
#ifndef __dsPIC33FJ128GP802__
#define __dsPIC33FJ128GP802__
#endif

/*Standars includes*/
#include <stdint.h>
#include <stdio.h> 
#include <dsp.h>

/*Config includes*/
#include "xc.h"
#include "config.h"

/*FreeRTOS includes*/
#include "FreeRTOS.h"
#include "FreeRTOSConfig.h"
#include "list.h"
#include "queue.h"
#include "task.h"
#include "timers.h"
#include "semphr.h"

/*Peripherals drivers includes*/
#include "anemometroDef.h"
#include "adc.h"
#include "pwm.h"
#include "UART_RTOS.h"
#include "timer.h"

/*Funciones locales*/
static void prvSetupHardware(void);

/*--------Tasks declaration---------*/
//static void led_test_task(void *pvParameters);
//static void transductor_test_task(void *pvParameters);

static void anemometro_main_task(void *pvParameters);

/*FreeRTOS declarations*/
static TaskHandle_t xMainTaskHandle = NULL;
static QueueHandle_t qRecf;

/*Global variables*/
float detect_delta_O = DETECTION_ERROR_O;
float detect_delta_E = DETECTION_ERROR_E;
float detect_delta_N = DETECTION_ERROR_N;
float detect_delta_S = DETECTION_ERROR_S;

static anemometro_mode_enum anemometroModoActivo = Menu;

uint8_t medProgFlag = 0;
uint8_t medAborted = 0;

int main(void) {
    //Inicio Hardware
    prvSetupHardware();

    //Output compare
    comparadorInit();
    //    comparador_rtos_init();

    //ADC init
    adc_init();

    //UART init
    uartInit_RTOS();
    //    uartInit();
    //Timer 32bits
    timerInit();

    //Queues init
    qRecf = xQueueCreate(5, sizeof (float));

    if (qRecf == NULL) {
        while (1);
    }

    //FreeRTOS inits
    if (xTaskCreate(anemometro_main_task,
            "anemometro_main_task",
            configMINIMAL_STACK_SIZE * 3,
            NULL,
            tskIDLE_PRIORITY + 3,
            &xMainTaskHandle) != pdPASS) {
        while (1);
    }

    LED_OFF;

    vTaskStartScheduler();

    while (1);

    return 0;
}

static void anemometro_main_task(void *pvParameters) {
    wind_medicion_type abortMed = {9995.99, 9995.99};
    anemometro_config_enum configOption = ExitConfig;
    wind_medicion_type simpleMed = {0, 0};
    mux_transSelect_enum emisorSelect = TRANS_EMISOR_OESTE;
    uint16_t auxV = 0;
    TickType_t xLastWakeTime;
    unsigned int firstPeriodFlag = 1;
    float soundSpeed = 345.7;
    float coordVmed[2];
    uint32_t medPeriod = 10;
    BaseType_t medState = pdFAIL;

    MUX_INPUT_INH(0);

    DELAY_50uS;

    LED_ON;

    while (1) {
        switch (anemometroModoActivo) {
            case Menu:
                //Bandera para inciar medicion periodica
                firstPeriodFlag = 1;
                //Enum del menu configuracion
                configOption = ExitConfig;
                //Espero a que se elija un modo de func
                anemometroModoActivo = uartGetMode();
                //Variables auxiliares para mediciones varias
                if (emisorSelect > TRANS_EMISOR_SUR) emisorSelect = TRANS_EMISOR_OESTE;
                auxV = 0;

                break;
            case Medicion_Simple:
                //Mide las componentes de cada coordenada de la velocidad
                medState = anemometroVmedian(&coordVmed[0], &coordVmed[1]);

                //Calcula el modulo y direccion de la velocidad
                if (medState == pdPASS) {
                    simpleMed = anemometroGetMed(coordVmed[0], coordVmed[1]);

                    medState = pdFAIL;
                } else {
                    sprintf(simpleMed.coord, " F ");
                }

                uartSendMed(&simpleMed);

                anemometroModoActivo = Menu;
                break;
            case Medicion_Continua:

                //Mide periodicamente la velocidad y direccion del viento
                if (firstPeriodFlag == 1) {
                    xLastWakeTime = xTaskGetTickCount();
                    firstPeriodFlag = 0;
                }
                //Inicia medicion
                medProgFlag = 1;

                if (anemometroVmedian(&coordVmed[0], &coordVmed[1]) == pdPASS) {

                    simpleMed = anemometroGetMed(coordVmed[0], coordVmed[1]);

                } else {
                    //Error de medicion
                    sprintf(simpleMed.coord, " F ");
                }

                uartSendMed(&simpleMed);

                anemometroModoActivo = uartGetMode();

                //Finaliza medicion
                medProgFlag = 0;

                //Delay definido por configuracion
                if (anemometroModoActivo == Medicion_Continua) {
                    vTaskDelayUntil(&xLastWakeTime, (medPeriod * 1000) / portTICK_PERIOD_MS);
                }

                break;
            case Configuracion:

                configOption = uartGetModeConfig();

                switch (configOption) {
                    case CalCero:
                        /*Calibracion con viento nulo: 
                         *identifica el error en la deteccion 
                         *del tren de pulsos con el tiempo teorico */

                        xQueueReceive(qRecf, &soundSpeed, portMAX_DELAY);

                        if (soundSpeed == 999.99) {
                            //Deja los valores definidos originalmente
                            detect_delta_O = (float) DETECTION_ERROR_O;
                            detect_delta_E = (float) DETECTION_ERROR_E;
                            detect_delta_N = (float) DETECTION_ERROR_N;
                            detect_delta_S = (float) DETECTION_ERROR_S;
                        } else {
                            anemometroCalibCero(soundSpeed);
                        }

                        //Muestra al usuario los valores obtenidos
                        simpleMed.mag = detect_delta_O * 1000000;
                        simpleMed.deg = detect_delta_E * 1000000;
                        uartSendMed(&simpleMed);

                        simpleMed.mag = detect_delta_N * 1000000;
                        simpleMed.deg = detect_delta_S * 1000000;
                        uartSendMed(&simpleMed);
                        simpleMed.mag = 0;
                        simpleMed.deg = 0;

                        configOption = ExitConfig;
                        break;
                    case SetEmi:
                        /*Configura MUX manualmente
                         *configuracion usada en etapa de pruebas/debug
                         *irrelevante ahora*/
                        configOption = uartGetModeConfig();
                        if (configOption == 1) emisorSelect = TRANS_EMISOR_NORTE;
                        if (configOption == 2) emisorSelect = TRANS_EMISOR_SUR;
                        if (configOption == 3) emisorSelect = TRANS_EMISOR_ESTE;
                        if (configOption == 4) emisorSelect = TRANS_EMISOR_OESTE;
                        configOption = ExitConfig;
                        break;
                    case SetPeriod:
                        //Permite elegir el periodo de medicion en el modo automatico
                        configOption = uartGetModeConfig();
                        if (configOption == 1) medPeriod = 5;
                        if (configOption == 2) medPeriod = 10;
                        if (configOption == 3) medPeriod = 30;
                        if (configOption == 4) medPeriod = 60;
                        if (configOption == 5) medPeriod = 600;
                        configOption = ExitConfig;
                        break;
                    case ExitConfig:
                        anemometroModoActivo = Menu;
                        break;
                    default: anemometroModoActivo = Menu;
                }

                anemometroModoActivo = Menu;
                break;
            default: anemometroModoActivo = Menu;
        }
    }
}

