mauro-medina10/dsPIC33F_FreeRTOS_Anemometro_v1/Demo/dsPIC33F_MPLAB/main.c
/*NO USADA
 *calcula velocidad a partir de la moda*/
BaseType_t anemometroVmode(float* medOE, float* medNS, uint8_t Nmode) {
    BaseType_t modeState = pdPASS;
    float velNmedicionesR[N_MED_MODE];
    float velNmedicionesT[N_MED_MODE];
    float timeMode[4];
    uint8_t n = 0, i = 0;
    float timeCorr[] = {0, 0};

    for (i = 0; i < 4; i += 2) {
        for (n = 0; n < N_MED_MODE; n++) {

            anemometroGetTmode(&velNmedicionesR[n], &velNmedicionesT[n], TRANS_EMISOR_OESTE + i);

            vTaskDelay(1 / portTICK_PERIOD_MS);

        }
        modeState *= anemometroCalcMode(velNmedicionesR, &timeMode[i], N_MED_MODE);

        modeState *= anemometroCalcMode(velNmedicionesT, &timeMode[1 + i], N_MED_MODE);
    }

    if (modeState == pdFAIL) return modeState;

    //Calculo V para OE
    timeCorr[0] = timeMode[0] - detect_delta_O; //taOE
    timeCorr[1] = timeMode[1] - detect_delta_E; //trOE

    if (timeCorr[0] == timeCorr[1]) {
        *medOE = 0;
    } else {
        *medOE = (((float) DISTANCE_EO / 2) * (1 / timeCorr[0] - 1 / timeCorr[1])) - OFFSET_ERROR_EO;
        *medOE = (*medOE - DETECT_OFFSET_OE) / DETECT_SCALING_OE;
    }
    //Calculo V para NS
    timeCorr[0] = timeMode[2] - detect_delta_N; //taNS
    timeCorr[1] = timeMode[3] - detect_delta_S; //trNS

    if (timeCorr[0] == timeCorr[1]) {
        *medNS = 0;
    } else {
        *medNS = (((float) DISTANCE_NS / 2) * (1 / timeCorr[0] - 1 / timeCorr[1])) - OFFSET_ERROR_NS;
        *medNS = (*medNS - DETECT_OFFSET_NS) / DETECT_SCALING_NS;
    }

    return modeState;
}

 /*NO USADA
  *calcula el promedio de las mediciones en cada coordenada*/
BaseType_t anemometroVprom(float* medOE, float* medNS, uint8_t Nprom) {
    float medAcumOE = 0;
    float medAcumNS = 0;
    uint8_t medNpromOE = Nprom;
    uint8_t medNpromNS = Nprom;
    uint8_t i = 0;
    float medCoordOE = 0;
    float medCoordNS = 0;

    for (i = 0; i < Nprom; i++) {
        medCoordOE = anemometroGetVcoord(TRANS_EMISOR_OESTE);

        vTaskDelay(1 / portTICK_PERIOD_MS);

        medCoordNS = anemometroGetVcoord(TRANS_EMISOR_NORTE);

        if (medCoordOE < 100) {
            medAcumOE += medCoordOE;
        } else {
            medNpromOE--;
        }
        if (
                medCoordNS < 100) {
            medAcumNS += medCoordNS;
        } else {
            medNpromNS--;
        }
    }

    if (medNpromOE > (Nprom / 2) && medNpromNS > (Nprom / 2)) {
        *medOE = medAcumOE / medNpromOE;
        *medNS = medAcumNS / medNpromNS;

        return pdPASS;
    } else {
        *medOE = 666.66;
        *medNS = 666.66;
    }

    return pdFAIL;
}

/*Mide el ToF del tren de pulsos en una coordenada en particular 
 *con un emisor definido*/
BaseType_t anemometroGetCoordTime(float* timeMed, mux_transSelect_enum coordTime) {
    float timeCalc = 999.99;
    uint32_t ulNotificationValue;
    BaseType_t notifyStatus = pdFAIL;
    BaseType_t pulseDetected = pdFALSE;
    BaseType_t pulseCaptured = pdFALSE;

    if (anemometroMuxOutputSelect(coordTime) != pdTRUE) {
        return pdFAIL;
    }
    //Desactivo MUX 2
    MUX_INPUT_INH(1);

    DELAY_50uS;

    timerStart();

    //Señal de exitacion del emisor
    comparadorPulseTrain_NObloq(2);
    DELAY_100uS;
    comparadorPulseTrain_NObloq(4);

    DELAY_400uS;
    DELAY_50uS;

    //Activo Mux 2
    MUX_INPUT_INH(0);
    timerStop();

    adc_start();

    pulseCaptured = dma_capturePulse(coordTime);

    if (pulseCaptured == pdPASS) {
        pulseDetected = dma_detectPulse(coordTime, &timeCalc);

        if (pulseDetected == pdPASS) {
            //Calcula el ToF
            timeCalc += (((float) timerCount() / configCPU_CLOCK_HZ));

            *timeMed = timeCalc;

            return pdPASS;
        }
    }

    return pdFAIL;
}

/*Calcula la direccion y velocidad del viento a partir de las componentes*/
wind_medicion_type anemometroGetMed(float VcoordOE, float VcoordNS) {
    wind_medicion_type valMed = {0, 0};

    valMed.mag = sqrtf(VcoordOE * VcoordOE + VcoordNS * VcoordNS);

    if (valMed.mag == 0) {
        valMed.deg = 0;
        sprintf(valMed.coord, "   ");

        return valMed;
    }

    //Correccion lineal de la medicion
    valMed.mag = (valMed.mag - MED_OFFSET) / MED_SCALING;

    if (VcoordNS != 0) {
        //Calculo Angulo
        valMed.deg = (180 / 3.14159265) * atanf(VcoordOE / VcoordNS);

        //Correccion lineal del angulo
        if (fabsf(valMed.deg) >= ANGLE_OFFSET) {
            valMed.deg = (valMed.deg - ANGLE_OFFSET) / ANGLE_SCALING;
        }

        //Viento desde NorOeste: 0 < deg < 90
        if (VcoordOE > 0 && VcoordNS > 0) {
            if (valMed.deg < 20) {
                sprintf(valMed.coord, " N ");
                valMed.mag = valMed.mag / PARALLEL_SCALING;
            } else if (valMed.deg > 70) {
                sprintf(valMed.coord, " O ");
                valMed.mag = valMed.mag / PARALLEL_SCALING;
            } else {
                sprintf(valMed.coord, "N-O");
            }
        }
        //Viento desde Sur: 90 < deg < 270
        if (VcoordNS < 0) {
            valMed.deg += 180;

            if (valMed.deg < 110) {
                sprintf(valMed.coord, " O ");
                valMed.mag = valMed.mag / PARALLEL_SCALING;
            } else if (valMed.deg > 160 && valMed.deg < 200) {
                sprintf(valMed.coord, " S ");
                valMed.mag = valMed.mag / PARALLEL_SCALING;
            } else if (valMed.deg > 250) {
                sprintf(valMed.coord, " E ");
                valMed.mag = valMed.mag / PARALLEL_SCALING;
            } else {
                if (valMed.deg < 180) {
                    sprintf(valMed.coord, "S-O");
                } else {
                    sprintf(valMed.coord, "S-E");
                }
            }
        }
        //Viento desde NorEste: 270 < deg < 360
        if (VcoordOE < 0 && VcoordNS > 0) {
            valMed.deg += 360;

            if (valMed.deg > 340) {
                sprintf(valMed.coord, " N ");
                valMed.mag = valMed.mag / PARALLEL_SCALING;
            } else if (valMed.deg < 290) {
                sprintf(valMed.coord, " E ");
                valMed.mag = valMed.mag / PARALLEL_SCALING;
            } else {
                sprintf(valMed.coord, "N-E");
            }
        }
    } else if (VcoordOE > 0) {
        //Viento desde Oeste
        valMed.deg = 90;
        sprintf(valMed.coord, " O ");
        valMed.mag = valMed.mag / PARALLEL_SCALING;
    } else {
        //Viento desde Este
        valMed.deg = 270;
        sprintf(valMed.coord, " E ");
        valMed.mag = valMed.mag / PARALLEL_SCALING;
    }

