mauro-medina10/dsPIC33F_FreeRTOS_Anemometro_v1/Demo/dsPIC33F_MPLAB/main.c
    anemometroGetCoordTime(&medAux, TRANS_EMISOR_SUR);
    if (dma_ceroAligned(TRANS_EMISOR_SUR) == pdPASS) {
        sprintf(msg, "  SUR: OK\r\n%c", '\0');
        uartSend((uint8_t *) msg, sizeof (msg), portMAX_DELAY);
    } else {
        sprintf(msg, "  SUR: error\r\n%c", '\0');
        uartSend((uint8_t *) msg, sizeof (msg), portMAX_DELAY);
    }
    vTaskDelay(10 / portTICK_PERIOD_MS);
}

static void prvSetupHardware(void) {
#ifdef _PLLACTIVATED_
    // Configure Oscillator to operate the device at 40Mhz
    // Fosc= Fin*M/(N1*N2), Fcy=Fosc/2 = 40MHz
    // Fosc= 20M*32/(4*2)=80Mhz for 20M input clock
    PLLFBD = 30; // M=32
    CLKDIVbits.PLLPRE = 2; // N1=4
    CLKDIVbits.PLLPOST0 = 0; // N2=2
    CLKDIVbits.PLLPOST1 = 0;

    // Clock Switch to incorporate PLL
    __builtin_write_OSCCONH(0x03); // Initiate Clock Switch to 
    // FRC with PLL (NOSC=0b001)
    __builtin_write_OSCCONL(OSCCON | 0x01); // Start clock switching
    while (OSCCONbits.COSC != 0b011); // Wait for Clock switch to occur	

    // Wait for PLL to lock
    while (OSCCONbits.LOCK != 1) {
    };
#endif
    //Desactivo watchdog

    RCONbits.SWDTEN = 0;

    /* set LED0 pins as outputs */
    TRISAbits.TRISA4 = 0;
    DELAY_100uS;
    //Set mux control pins as outputs
    TRISAbits.TRISA0 = 0;
    DELAY_100uS;
    TRISAbits.TRISA1 = 0;
    DELAY_100uS;
    TRISBbits.TRISB4 = 0;
    DELAY_100uS;
    TRISBbits.TRISB9 = 0;
    DELAY_100uS;
    //    RB_8_SET_MODE(1);
    //    DELAY_100uS;
    RB_9_SET_MODE(0);
    DELAY_100uS
}

void vApplicationIdleHook(void) {

}